_static/architecture.diag
blockdiag {
    default_fontsize = 16;
    orientation = portrait;

    requests [shape = actor];
    config;
    command [shape = actor];
    cli;
    dependencies;
    handlers;
    factory;
    services;
    storage;
    datastore [shape = flowchart.database];

    command -> cli;
    config -> factory;
    factory -> handlers;
    factory -> cli;
    requests -> dependencies -> handlers;
    requests -> handlers -> services -> storage -> datastore;
    cli -> services;
}
